public class Runner1 {
    public static void main(String[] args) {
        //Вывести на консоль в столбик названия трех языков программирования,
        //переданные в main в качестве параметров: (Java, Java Script, C++)

        System.out.println(args[0]);
        System.out.println(args[1]);
        System.out.println(args[2]);

    }
}
